---
kind: method
id: M:Autodesk.Revit.DB.EdgeArrayArray.#ctor
source: html/f5769d15-b0f4-bc95-d474-89913f656a33.htm
---
# Autodesk.Revit.DB.EdgeArrayArray.#ctor Method

Initializes a new instance of the EdgeArrayArray class

## Syntax (C#)
```csharp
public EdgeArrayArray()
```